---
kind: other
id: Methods.T:Autodesk.Revit.DB.ConnectorManager
source: html/e7cbe210-061f-bc30-f5ad-8cf2b2c7d47e.htm
---
# ConnectorManager Methods

Lookup the connector using the unique index value that identify this connector.